final_project/domain_dependency_test/base_case_add1_fin/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   uniform 1e-5;

boundaryField
{

    inlet
    {
      type	calculated;
      value	uniform 1e-5;
    }

    outlet
    {
      type	zeroGradient;
    }

    wing
    {
	    type            nutkWallFunction;
      value	uniform 0;
    }
    sym1
    {
      type	zeroGradient;
    }

    sym2
    {
      type	zeroGradient;
    }

    top
    {
      type	zeroGradient;
    }

    bottom
    {
      type	zeroGradient;
    }
}


// ************************************************************************* //
